In [1]:
import pandas as pd
import numpy as np
cols = ['col0', 'col1', 'col2', 'col3', 'col4']
rows = ['row0', 'row1', 'row2', 'row3', 'row4']
data = np.random.randint(0, 100, size=(5, 5))
df = pd.DataFrame(data, columns=cols, index=rows)
df.head()

      col0  col1  col2  col3  col4
row0    31    54    71    25    34
row1    57     6    74    54    13
row2    43    18     5     5    94
row3    93    13    68    45     1
row4    52    38    51    71    21

In [2]:
df['col1']['row1']

6

In [6]:
df.loc['row1']

col0    57
col1     6
col2    74
col3    54
col4    13
Name: row1, dtype: int32

In [5]:
df.loc['row1', 'col1']

6

In [10]:
df.iloc[1]

col0    57
col1     6
col2    74
col3    54
col4    13
Name: row1, dtype: int32

In [11]:
df.iloc[1, 1]

6

In [12]:
df_new = df[['col1','col2']]
df_new.head(3)

      col1  col2
row0    54    71
row1     6    74
row2    18     5

In [13]:
df_new = df[['col1','col2']][1:4]
df_new.head(3)

      col1  col2
row1     6    74
row2    18     5
row3    13    68

In [15]:
df['col0']

row0    31
row1    57
row2    43
row3    93
row4    52
Name: col0, dtype: int32

In [16]:
df.loc[:,'col0']

row0    31
row1    57
row2    43
row3    93
row4    52
Name: col0, dtype: int32

In [17]:
df.iloc[:, 0]

row0    31
row1    57
row2    43
row3    93
row4    52
Name: col0, dtype: int32

In [18]:
df['col3'][2:5]

row2     5
row3    45
row4    71
Name: col3, dtype: int32

In [19]:
df.loc['row1':'row4', :]

      col0  col1  col2  col3  col4
row1    57     6    74    54    13
row2    43    18     5     5    94
row3    93    13    68    45     1
row4    52    38    51    71    21

In [20]:
df.iloc[1:4, :]

      col0  col1  col2  col3  col4
row1    57     6    74    54    13
row2    43    18     5     5    94
row3    93    13    68    45     1

In [21]:
df.loc[:, 'col1':'col4']

      col1  col2  col3  col4
row0    54    71    25    34
row1     6    74    54    13
row2    18     5     5    94
row3    13    68    45     1
row4    38    51    71    21

In [22]:
df.iloc[:, 1:4]

      col1  col2  col3
row0    54    71    25
row1     6    74    54
row2    18     5     5
row3    13    68    45
row4    38    51    71

In [23]:
df.loc['row1':'row4', 'col1':'col4']

      col1  col2  col3  col4
row1     6    74    54    13
row2    18     5     5    94
row3    13    68    45     1
row4    38    51    71    21

In [24]:
df[df['col1'] > 20]
# assigning variable also works
condition = df['col1'] > 20
df[condition]

      col0  col1  col2  col3  col4
row0    31    54    71    25    34
row4    52    38    51    71    21

In [25]:
df.iloc[3, 3] = 0
df.iloc[1, 2] = np.nan
df.iloc[4, 0] = np.nan
df['col5'] = 0
df['col6'] = np.NaN
df.head()

      col0  col1  col2  col3  col4  col5  col6
row0  31.0    54  71.0    25    34     0   NaN
row1  57.0     6   NaN    54    13     0   NaN
row2  43.0    18   5.0     5    94     0   NaN
row3  93.0    13  68.0     0     1     0   NaN
row4   NaN    38  51.0    71    21     0   NaN

In [26]:
df.loc[:, df.all()]

      col0  col1  col2  col4  col6
row0  31.0    54  71.0    34   NaN
row1  57.0     6   NaN    13   NaN
row2  43.0    18   5.0    94   NaN
row3  93.0    13  68.0     1   NaN
row4   NaN    38  51.0    21   NaN

In [27]:
df.loc[:, df.notnull().all()]

      col1  col3  col4  col5
row0    54    25    34     0
row1     6    54    13     0
row2    18     5    94     0
row3    13     0     1     0
row4    38    71    21     0

In [28]:
df.loc[:, df.isnull().any()]

      col0  col2  col6
row0  31.0  71.0   NaN
row1  57.0   NaN   NaN
row2  43.0   5.0   NaN
row3  93.0  68.0   NaN
row4   NaN  51.0   NaN

In [29]:
df.dropna(how='all', axis=1) # if all values in a column are NaN it will be dropped

      col0  col1  col2  col3  col4  col5
row0  31.0    54  71.0    25    34     0
row1  57.0     6   NaN    54    13     0
row2  43.0    18   5.0     5    94     0
row3  93.0    13  68.0     0     1     0
row4   NaN    38  51.0    71    21     0

In [30]:
df.dropna(how='any', axis=1) # if any value in a row is NaN it will be dropped

      col1  col3  col4  col5
row0    54    25    34     0
row1     6    54    13     0
row2    18     5    94     0
row3    13     0     1     0
row4    38    71    21     0

In [31]:
df = df.dropna(how='any', axis=1)
df

      col1  col3  col4  col5
row0    54    25    34     0
row1     6    54    13     0
row2    18     5    94     0
row3    13     0     1     0
row4    38    71    21     0